homework/c2/sysbench/oltp_point_select.128threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 4265.83 qps: 4265.83 (r/w/o: 4265.83/0.00/0.00) lat (ms,95%): 125.52 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 15099.77 qps: 15099.77 (r/w/o: 15099.77/0.00/0.00) lat (ms,95%): 22.69 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 16629.52 qps: 16629.52 (r/w/o: 16629.52/0.00/0.00) lat (ms,95%): 17.95 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 21099.44 qps: 21099.44 (r/w/o: 21099.44/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 22143.80 qps: 22143.80 (r/w/o: 22143.80/0.00/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 21603.25 qps: 21603.25 (r/w/o: 21603.25/0.00/0.00) lat (ms,95%): 12.52 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1008552
        write:                           0
        other:                           0
        total:                           1008552
    transactions:                        1008552 (16796.84 per sec.)
    queries:                             1008552 (16796.84 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0424s
    total number of events:              1008552

Latency (ms):
         min:                                    0.96
         avg:                                    7.62
         max:                                 1299.45
         95th percentile:                       16.71
         sum:                              7681091.24

Threads fairness:
    events (avg/stddev):           7879.3125/206.11
    execution time (avg/stddev):   60.0085/0.01