homework/c2/sysbench/oltp_point_select.16threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 16
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 16 tps: 10487.93 qps: 10487.93 (r/w/o: 10487.93/0.00/0.00) lat (ms,95%): 1.96 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 16 tps: 10465.68 qps: 10465.68 (r/w/o: 10465.68/0.00/0.00) lat (ms,95%): 1.96 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 16 tps: 10519.31 qps: 10519.31 (r/w/o: 10519.31/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 16 tps: 10643.41 qps: 10643.41 (r/w/o: 10643.41/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 16 tps: 10566.49 qps: 10566.49 (r/w/o: 10566.49/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 16 tps: 10611.74 qps: 10611.74 (r/w/o: 10611.74/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            632984
        write:                           0
        other:                           0
        total:                           632984
    transactions:                        632984 (10548.42 per sec.)
    queries:                             632984 (10548.42 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0057s
    total number of events:              632984

Latency (ms):
         min:                                    0.92
         avg:                                    1.52
         max:                                   33.19
         95th percentile:                        1.93
         sum:                               959640.64

Threads fairness:
    events (avg/stddev):           39561.5000/3604.20
    execution time (avg/stddev):   59.9775/0.00