homework/c2/sysbench/oltp_point_select.8threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 8
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 8 tps: 5678.23 qps: 5678.23 (r/w/o: 5678.23/0.00/0.00) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 8 tps: 5607.22 qps: 5607.22 (r/w/o: 5607.22/0.00/0.00) lat (ms,95%): 1.70 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 8 tps: 5674.49 qps: 5674.49 (r/w/o: 5674.49/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 8 tps: 5700.01 qps: 5700.01 (r/w/o: 5700.01/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 8 tps: 5717.82 qps: 5717.82 (r/w/o: 5717.82/0.00/0.00) lat (ms,95%): 1.61 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 8 tps: 5663.81 qps: 5663.81 (r/w/o: 5663.81/0.00/0.00) lat (ms,95%): 1.64 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            340435
        write:                           0
        other:                           0
        total:                           340435
    transactions:                        340435 (5673.40 per sec.)
    queries:                             340435 (5673.40 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.0037s
    total number of events:              340435

Latency (ms):
         min:                                    0.98
         avg:                                    1.41
         max:                                   22.94
         95th percentile:                        1.64
         sum:                               479785.84

Threads fairness:
    events (avg/stddev):           42554.3750/4288.55
    execution time (avg/stddev):   59.9732/0.00