homework/c2/sysbench/oltp_read_only.128threads.log
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 128
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 128 tps: 465.09 qps: 7541.73 (r/w/o: 6599.27/0.00/942.47) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 128 tps: 473.72 qps: 7584.37 (r/w/o: 6637.13/0.00/947.23) lat (ms,95%): 337.94 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 128 tps: 483.30 qps: 7716.30 (r/w/o: 6750.70/0.00/965.60) lat (ms,95%): 325.98 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 477.90 qps: 7655.77 (r/w/o: 6698.67/0.00/957.10) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 128 tps: 479.80 qps: 7667.53 (r/w/o: 6709.23/0.00/958.30) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 479.29 qps: 7674.20 (r/w/o: 6715.22/0.00/958.97) lat (ms,95%): 331.91 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            402066
        write:                           0
        other:                           57438
        total:                           459504
    transactions:                        28719  (476.54 per sec.)
    queries:                             459504 (7624.67 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.2637s
    total number of events:              28719

Latency (ms):
         min:                                  111.83
         avg:                                  268.06
         max:                                  481.92
         95th percentile:                      331.91
         sum:                              7698543.78

Threads fairness:
    events (avg/stddev):           224.3672/2.86
    execution time (avg/stddev):   60.1449/0.08